
## :white_check_mark: Apply Succeeded (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/19185)



<pre><code>Apply complete! Resources: 1 added, 3 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-default-file_658064DB: Reading...
data.archive_file.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-default-file_658064DB: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.proxy-lambda_fxa-events-sqs-lambda_lambda-default-file_C2204174: Reading...
data.archive_file.proxy-lambda_fxa-events-sqs-lambda_lambda-default-file_C2204174: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Reading...
aws_codedeploy_app.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_36CDF2A9: Refreshing state... [id=c743b0db-f0eb-4ac4-a22a-7a5df292fbbf:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Lambda]
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_494AA977: Reading...
data.aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_main_hosted_zone_52D95F8D: Reading...
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Reading...
data.aws_region.pocket-shared-vpc_current_region_847136C5: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_494AA977: Read complete after 0s [id=4250039221]
aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_8A609C89: Refreshing state... [id=Z03974732S55G3DTUY81O]
data.aws_region.pocket-shared-vpc_current_region_847136C5: Read complete after 0s [id=us-east-1]
aws_codedeploy_app.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-app_BC3071ED: Refreshing state... [id=ef18be86-939c-41e9-95eb-d8e6e63d755e:FxAWebhookProxy-Prod-Sqs-FxA-Events-Lambda]
aws_s3_bucket.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket_C7C951C2: Refreshing state... [id=pocket-fxawebhookproxy-prod-apigateway-fxa-events]
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_assume-policy-document_B7F6A483: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_assume-policy-document_B7F6A483: Read complete after 0s [id=1349007126]
data.aws_ssm_parameter.proxy-lambda_service-hash_00833657: Reading...
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Reading...
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Read complete after 0s [id=/FxAWebhookProxy/Prod/SENTRY_DSN]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Critical]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_EE183E17: Reading...
data.aws_ssm_parameter.proxy-lambda_service-hash_00833657: Read complete after 0s [id=/FxAWebhookProxy/CircleCI/Prod/SERVICE_HASH]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_assume-policy-document_4F92B2E4: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_EE183E17: Read complete after 0s [id=4250039221]
aws_acm_certificate.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_AB4BFA3E: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/cfad8aed-2535-4bfe-ab3e-b19a7b763968]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_assume-policy-document_4F92B2E4: Read complete after 0s [id=1349007126]
data.aws_ssm_parameter.proxy-lambda_sentry-dsn_32A7918F: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Reading...
data.aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_main_hosted_zone_52D95F8D: Read complete after 0s [id=Z21HMDYFB951W4]
data.aws_ssm_parameter.proxy-lambda_sentry-dsn_32A7918F: Read complete after 0s [id=/FxAWebhookProxy/Prod/SENTRY_DSN]
aws_sqs_queue.sqs-queue_redrive_sqs_queue_7787A983: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/FxAWebhookProxy-Prod-Queue-Deadletter]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Reading...
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Refreshing state... [id=b1aoz7w8yj]
aws_s3_bucket.proxy-lambda_fxa-events-sqs-lambda_code-bucket_18BE403F: Refreshing state... [id=pocket-fxawebhookproxy-prod-sqs-fxa-events]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Read complete after 0s [id=/Shared/Vpc]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role_0FCA3369: Refreshing state... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRole]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Read complete after 0s [id=/FxAWebhookProxy/CircleCI/Prod/SERVICE_HASH]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_execution-policy-document_AC2C64C8: Reading...
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Reading...
aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_2351D7DE: Refreshing state... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-CodeDeployRole]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_execution-policy-document_AC2C64C8: Read complete after 0s [id=2301264021]
aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-role_EAFFD8C6: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-CodeDeployRole]
aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_execution-role_49DCFF7B: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRole]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_ns_C49E1CCC: Refreshing state... [id=Z21HMDYFB951W4_fxa-events.getpocket.com_NS]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_vpc.pocket-shared-vpc_405D247E: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P3IXK8C]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P099JWP]
aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_execution-policy_42E5C2FC: Refreshing state... [id=arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRolePolicy]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_certificate_record_63795587: Refreshing state... [id=Z03974732S55G3DTUY81O__91ff647cfa4ba549971ee73bb0d6e21e.fxa-events.getpocket.com._CNAME]
aws_s3_bucket_public_access_block.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-public-access-block_B05F905E: Refreshing state... [id=pocket-fxawebhookproxy-prod-apigateway-fxa-events]
aws_s3_bucket_ownership_controls.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-ownership-controls_A8EB8BA0: Refreshing state... [id=pocket-fxawebhookproxy-prod-apigateway-fxa-events]
aws_sqs_queue.sqs-queue_sqs_queue_46EA6754: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/FxAWebhookProxy-Prod-Queue]
aws_api_gateway_resource.apigateway-lambda_fxa-events-apigateway-lambda_events_41F30C7F: Refreshing state... [id=4uxdsf]
aws_iam_role_policy_attachment.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_71B3F162: Refreshing state... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-CodeDeployRole-20230717161113263000000003]
aws_codedeploy_deployment_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_C7221F61: Refreshing state... [id=e220cd6d-dc1e-4b35-864d-e6e86e24def0]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-policy-attachment_4207928B: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-CodeDeployRole-20230717221640313900000002]
data.aws_sqs_queue.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7: Reading...
aws_codedeploy_deployment_group.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deployment-group_768043C9: Refreshing state... [id=75c2695d-584a-453c-996c-04b468258199]
data.aws_sqs_queue.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/FxAWebhookProxy-Prod-Queue]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P2MQ7F3]
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233: Read complete after 0s [id=1842137200]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P6YB8UT]
aws_api_gateway_method.apigateway-lambda_fxa-events-apigateway-lambda_events-method_05BB56A7: Refreshing state... [id=agm-b1aoz7w8yj-4uxdsf-POST]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5: Read complete after 0s [id=1782800727]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_execution-role-policy-attachment_3F345CC0: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRole-20230717221640191500000001]
aws_s3_bucket_acl.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-acl_7EB58285: Refreshing state... [id=pocket-fxawebhookproxy-prod-apigateway-fxa-events,private]
aws_iam_policy.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy_3C519FF1: Refreshing state... [id=arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRolePolicy]
aws_s3_bucket_public_access_block.proxy-lambda_fxa-events-sqs-lambda_code-bucket-public-access-block_89A7C542: Refreshing state... [id=pocket-fxawebhookproxy-prod-sqs-fxa-events]
aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_sqs-policy_C749EED1: Refreshing state... [id=arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-Sqs-FxA-Events-LambdaSQSPolicy]
aws_s3_bucket_ownership_controls.proxy-lambda_fxa-events-sqs-lambda_code-bucket-ownership-controls_1D4EB6CA: Refreshing state... [id=pocket-fxawebhookproxy-prod-sqs-fxa-events]
aws_acm_certificate_validation.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_certificate_validation_222CD37E: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PI9O7PK]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PLIZ82N]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Non-Critical:a301add9-dce4-4d4f-8dbd-bf09bc2871ab]
aws_iam_role_policy_attachment.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role-policy-attachment_D0B5FF91: Refreshing state... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRole-20230717221730575500000003]
aws_s3_bucket_acl.proxy-lambda_fxa-events-sqs-lambda_code-bucket-acl_4AD39755: Refreshing state... [id=pocket-fxawebhookproxy-prod-sqs-fxa-events,private]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_execution-role-policy-attachment_A9491264: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRole-20230717221730583900000004]
data.aws_vpc.pocket-shared-vpc_405D247E: Read complete after 1s [id=vpc-867638e3]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Critical:2e71fb05-a952-40b0-aa76-54bdceefbbfa]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Reading...
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Reading...
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Reading...
aws_api_gateway_domain_name.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-domain-name_AAD407DE: Refreshing state... [id=fxa-events.getpocket.com]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_apigateway-route53-domain-record_D3B870B4: Refreshing state... [id=Z03974732S55G3DTUY81O_fxa-events.getpocket.com_A]
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Read complete after 0s [id=us-east-1]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Refreshing state... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function]
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Refreshing state... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-Function]
aws_cloudwatch_log_group.proxy-lambda_fxa-events-sqs-lambda_log-group_026C85E5: Refreshing state... [id=/aws/lambda/FxAWebhookProxy-Prod-Sqs-FxA-Events-Function]
aws_lambda_alias.proxy-lambda_fxa-events-sqs-lambda_alias_AD7643EF: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:DEPLOYED]
aws_cloudwatch_log_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_log-group_FCA0AB36: Refreshing state... [id=/aws/lambda/FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function]
aws_lambda_alias.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_alias_48A3E53D: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:DEPLOYED]
aws_lambda_event_source_mapping.proxy-lambda_fxa-events-sqs-lambda_lambda_event_source_mapping_0005C71C: Refreshing state... [id=f5e19988-75fd-43ff-83c4-a29c3fff9cc4]
aws_api_gateway_integration.apigateway-lambda_fxa-events-apigateway-lambda_events-integration_481F0AED: Refreshing state... [id=agi-b1aoz7w8yj-4uxdsf-POST]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Refreshing state... [id=2c5j1h]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Refreshing state... [id=ags-b1aoz7w8yj-prod]
aws_lambda_permission.apigateway-lambda_fxa-events-apigateway-lambda_apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_alias_48A3E53D-allow-gateway-lambda-invoke_2CBDADB9: Refreshing state... [id=terraform-20230717221755285700000005]
aws_api_gateway_base_path_mapping.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-base-path-mapping_E3B14CBE: Refreshing state... [id=fxa-events.getpocket.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-01-19T19:08:44Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:b1aoz7w8yj/" -> (known after apply)
      ~ id            = "2c5j1h" -> (known after apply)
      ~ invoke_url    = "https://b1aoz7w8yj.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1705691287502" -> "1705947248234"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "2c5j1h" -> (known after apply)
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171" {
        id                             = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:765" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function:765/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "765" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"            = (sensitive value)
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609 will be updated in-place
  ~ resource "aws_lambda_function" "proxy-lambda_fxa-events-sqs-lambda_39345609" {
        id                             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:798" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:798/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "FxAWebhookProxy"
        }
      ~ version                        = "798" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"     = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Modifying... [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-Function]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Modifying... [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Modifications complete after 7s [id=FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creating...
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creation complete after 0s [id=m0vveh]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifying... [id=ags-b1aoz7w8yj-prod]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifications complete after 1s [id=ags-b1aoz7w8yj-prod]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 (deposed object 2e738e3f): Destroying... [id=2c5j1h]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Destruction complete after 0s
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Modifications complete after 8s [id=FxAWebhookProxy-Prod-Sqs-FxA-Events-Function]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1672, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1672:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵

Apply complete! Resources: 1 added, 3 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"71ca33e5-8612-4b34-b3aa-60cfa251f8b9","JobName":"fxa-webhook-proxy_infrastructure_apply_prod","PRNumber":84,"Program":"tfcmt","SHA1":"03f2dc7c24b82ea5455f7fd95b3302bdbfdc8848","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->